parser/org-syntax.org
#+TITLE: SMUG Org Syntax
#+AUTHOR: Drew Crampsie, Nicolas Goaziou
#+OPTIONS: toc:t ':t author:nil
#+LANGUAGE: en
#+BIND: sentence-end-double-space t

This document describes and comments Org syntax as it is currently
read by the SMUG parser. 

It is very close to (Org Elements) and, therefore, the export
framework.  It also includes a few comments on that syntax.

#+BEGIN_SRC emacs-lisp 
  (setf *org-babel-use-quick-and-dirty-noweb-expansion* t)
#+END_SRC

* Syntax 

Unless specified otherwise, case is not significant.

#+name: syntax 
#+BEGIN_SRC lisp
  (defclass syntax () ())  
#+END_SRC

** Document 
#+name: document 
#+BEGIN_SRC lisp :tangle org/document.lisp :noweb yes
  (defpackage :smug/parser/org/document 
    (:use :cl :smug/parser/org/dot 
          :smug/parser/org/util
          :smug/parser/org/syntax)
    (:import-from :smug/parser/org/section
                  #:.section)
    (:import-from :smug/file)
    (:import-from :smug/parser/org/outline
                  #:.outline
                  #:outline-headline
                  #:outline-sub-outlines)
    (:import-from :smug/parser/org/headline 
                  #:headline-title
                  #:headline-stars
                  #:headline-level)
    (:import-from :smug/parser/org/keyword
                  #:.keyword #:keywords
                  #:get-keyword
                  #:keyword-value)
    (:export #:document
             #:read-document
             #:.document
             #:document-section
             #:document-outlines
             #:document-title
             #:find-outline))
  (in-package :smug/parser/org/document)
  
  (defclass document (keywords syntax)
    ((section :accessor document-section
              :initarg :section)
     (outlines :accessor document-outlines
               :initarg :outlines)
     (pathname :accessor document-pathname 
               :initarg :pathname
               :initform nil)))
  
  (defun document-title (document)
    (or 
     (ignore-errors (keyword-value (get-keyword "TITLE" document)))
     (first (document-section document))
     (document-pathname document)))
  
  (defun .document (&key (section (.section)))
    (.make-instance 
     'document 
     :keywords (.some (.keyword))
     :section (.section)
     :outlines (.some (smug/parser/org/outline:.outline))))
  
  (defun find-outline (headline document)
    (block outline 
      (labels 
          ((findo (outlines)
             (find headline outlines
                   :test 
                   (lambda (headline outline) 
                     (or (when (string= headline 
                                        (headline-title (outline-headline outline)))
                           (return-from outline outline))
                         (findo (outline-sub-outlines outline)))))))
        (findo (document-outlines document)))))
                                    
  
  (defun read-document (source &key (pathname))
    (let* ((source-string (etypecase source
                            (pathname (smug/file:read-file-into-string source))
                            (t source))))
      (multiple-value-bind (document leftover others)
          (.run (.document) source-string)
        (multiple-value-prog1 (values document leftover others)
          (when (or pathname (pathnamep source))
            (setf (document-pathname document) source))))))
    
    
#+END_SRC

** Environments

Three categories are used to classify the environments: "Greater
elements", "elements", and "objects", from the broadest scope to the
narrowest.  The word "element" is used for both Greater and non-Greater
elements, the context should make that clear.

#+name: environment
#+BEGIN_SRC lisp :tangle org/environment.lisp
  (defpackage :smug/parser/org/environment
    (:use :cl  
          :smug/parser/org/util
          :smug/parser/org/syntax)
    (:export #:environment))
  (in-package :smug/parser/org/environment)
  
  (defclass environment (whitespace syntax) 
    ((start-input :accessor environment-start-input 
            :initarg :start-input)
     (end-input :accessor environment-end-input)))
#+END_SRC

The paragraph is the unit of measurement.  An element defines
syntactical parts that are at the same level as a paragraph,
i.e. which cannot contain or be included in a paragraph.  An object is
a part that could be included in an element.  Greater elements are all
parts that can contain an element.

Empty lines belong to the largest element ending before them.  For
example, in a list, empty lines between items belong are part of the
item before them, but empty lines at the end of a list belong to the
plain list element.

Unless specified otherwise, case is not significant.

** .string-of

#+NAME: .string-of 
#+BEGIN_SRC lisp
  (defun .string-of (parser &key (using '.some))
    (.coerce (funcall using parser) 'cl:string))  
#+END_SRC

** Whitespace and Lines 

#+NAME: .whitespace
#+BEGIN_SRC lisp
  (defvar *whitespace* '(#\Space #\Tab)) 

  (defun .whitespace ()
    (.is 'member *whitespace*))
  
  (defclass whitespace (syntax)
    ((whitespace-prefix :initarg :whitespace-prefix
          :accessor whitespace-prefix)
     (whitespace-postfix :initarg :whitespace-postfix
           :accessor whitespace-postfix)))
#+END_SRC


#+NAME: .line
#+BEGIN_SRC lisp
(defun .line (&optional (nl #\Newline))
  (.prog1 (.coerce (.some (.is-not #'char= nl)) 
		   'cl:string)
	  (.is #'char= nl)))
#+END_SRC

** Until 
#+NAME: .until
#+BEGIN_SRC lisp
  (defstruct until 
    contents end)
  
  (defun .until (parser &key (do (.item)) contents)
    (.let* ((until (.or parser (.result nil))))
      (if until 
          (.result (cons (reverse contents)
                         until))
          (.let* ((first do))
            (.until parser :do do :contents (list* first contents))))))  
#+END_SRC

** Syntax package/file

#+HEADER: :padline no
#+BEGIN_SRC lisp :tangle org/syntax.lisp :noweb tangle
  (defpackage :smug/parser/org/syntax
    (:use :cl 
          :smug/parser/org/dot)
    (:export #:syntax
             #:whitespace
             #:.whitespace
             #:*whitespace*
             #:.line
             #:.until
             #:.string-of))
  (in-package :smug/parser/org/syntax)
  
  <<syntax>>
  
  (defmethod print-object ((object syntax) stream)
    (print-unreadable-object (object stream :type t)
      (let* ((class (class-of object))
             (block (c2mop:class-slots class)))
        (pprint-logical-block (stream block)
          (loop 
             (let ((slotd (pprint-pop)))
               (pprint-indent :block 1)
               (princ (c2mop:slot-definition-name slotd) stream)
               (write-char #\Space stream)
               (format stream "~S" (handler-case 
                           (c2mop:slot-value-using-class class object slotd)
                                     (unbound-slot ()
                           "#<unbound>"))))
             (write-char #\Space stream) 
             (pprint-exit-if-list-exhausted)
             (pprint-newline :mandatory stream))))))
    
  <<.whitespace>>  
  
  <<.line>>
  
  <<.until>>

  <<.string-of>>
#+END_SRC

* Outline 

It starts with [[info:emacs#Outline%20Format][outlines]], which in this case are made up of headlines
and sections. A core concept in this syntax is that only headlines
and sections are context-free[fn:1][fn:2].  Every other syntactical
part only exists within specific environments.

An outline contains directly one headline, one section (optionally),
followed by any number of deeper level outlines.

#+name: outline
#+BEGIN_SRC lisp
  (defclass outline (syntax) 
    ((headline :accessor outline-headline
               :initarg :headline)
     (section :accessor outline-section
              :initarg :section)
     (sub-outlines :accessor outline-sub-outlines)
     (start-input :accessor outline-start-input 
            :initarg :start-input)
     (end-input :accessor outline-end-input)))
  
    
  (defun .same-level-or-less-headline (headline)
    (.let* ((new-headline (.headline)))
      (.guard #'identity 
              (<= (headline-level new-headline)
                  (headline-level headline)))))
      
  (defun .outline (&key 
                     (headline (.headline))
                     (section (.optional (.section))))
    
    (.let* ((outline 
             (.make-instance 'outline
                             :start-input (.input)
                             :headline headline
                             :section section))
            (subs (.some
                   (.progn (.not (.same-level-or-less-headline
                                  (outline-headline outline)))
                           (.outline))))
            (end (.input)))
      (prog1 (.result outline)
        (setf (outline-sub-outlines outline) subs
              (outline-end-input outline) end))))
#+END_SRC
