parser/org-syntax.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Org Syntax (draft)</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Org Syntax (draft)"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-03-08T13:58-0800"/>
<meta name="author" content="Nicolas Goaziou"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Org Syntax (draft)</h1>

<p>This document describes and comments Org syntax as it is currently
read by its parser (Org Elements) and, therefore, by the export
framework.  It also includes a few comments on that syntax.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Syntax</a></li>
<li><a href="#Headlines_and_Sections">2 Headlines and Sections</a>
<ul>
<li><a href="#sec-2-1">2.1 Headline</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 STARS</a></li>
<li><a href="#sec-2-1-2">2.1.2 KEYWORDS</a></li>
<li><a href="#sec-2-1-3">2.1.3 PRIORITY</a></li>
<li><a href="#sec-2-1-4">2.1.4 TITLE</a></li>
<li><a href="#sec-2-1-5">2.1.5 TAGS</a></li>
<li><a href="#sec-2-1-6">2.1.6 Valid Headlines</a></li>
<li><a href="#sec-2-1-7">2.1.7 comments and quotes</a></li>
<li><a href="#sec-2-1-8">2.1.8 footnote-section</a></li>
<li><a href="#sec-2-1-9">2.1.9 archive-tag</a></li>
<li><a href="#sec-2-1-10">2.1.10 The headline file</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 Sections</a></li>
</ul>
</li>
<li><a href="#Affiliated_keywords">3 Affiliated Keywords</a></li>
<li><a href="#Greater_Elements">4 Greater Elements</a>
<ul>
<li><a href="#Greater_Blocks">4.1 Greater Blocks</a></li>
<li><a href="#Drawers_and_Property_Drawers">4.2 Drawers and Property Drawers</a></li>
<li><a href="#Dynamic_Blocks">4.3 Dynamic Blocks</a></li>
<li><a href="#Footnote_Definitions">4.4 Footnote Definitions</a></li>
<li><a href="#Inlinetasks">4.5 Inlinetasks</a></li>
<li><a href="#Plain_Lists_and_Items">4.6 Plain Lists and Items</a></li>
<li><a href="#Tables">4.7 Tables</a></li>
</ul>
</li>
<li><a href="#Elements">5 Elements</a>
<ul>
<li><a href="#Babel_Call">5.1 Babel Call</a></li>
<li><a href="#Blocks">5.2 Blocks</a></li>
<li><a href="#Clock-_Diary_Sexp_and_Planning">5.3 Clock, Diary Sexp and Planning</a></li>
<li><a href="#Comments">5.4 Comments</a></li>
<li><a href="#Fixed_Width_Areas">5.5 Fixed Width Areas</a></li>
<li><a href="#Horizontal_Rules">5.6 Horizontal Rules</a></li>
<li><a href="#Keywords">5.7 Keywords</a></li>
<li><a href="#LaTeX_Environments">5.8 LaTeX Environments</a></li>
<li><a href="#Node_Properties">5.9 Node Properties</a></li>
<li><a href="#Paragraphs">5.10 Paragraphs</a></li>
<li><a href="#Table_Rows">5.11 Table Rows</a></li>
</ul>
</li>
<li><a href="#Objects">6 Objects</a>
<ul>
<li><a href="#Entities_and_LaTeX_Fragments">6.1 Entities and LaTeX Fragments</a></li>
<li><a href="#Export_Snippets">6.2 Export Snippets</a></li>
<li><a href="#Footnote_References">6.3 Footnote References</a></li>
<li><a href="#Inline_Babel_Calls_and_Source_Blocks">6.4 Inline Babel Calls and Source Blocks</a></li>
<li><a href="#Line_Breaks">6.5 Line Breaks</a></li>
<li><a href="#Links">6.6 Links</a></li>
<li><a href="#Macros">6.7 Macros</a></li>
<li><a href="#Targets_and_Radio_Targets">6.8 Targets and Radio Targets</a></li>
<li><a href="#Statistics_Cookies">6.9 Statistics Cookies</a></li>
<li><a href="#Subscript_and_Superscript">6.10 Subscript and Superscript</a></li>
<li><a href="#Table_Cells">6.11 Table Cells</a></li>
<li><a href="#Timestamp">6.12 Timestamps</a></li>
<li><a href="#Emphasis_Markers">6.13 Text Markup</a></li>
</ul>
</li>
<li><a href="#sec-7">7 Appendix</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Syntax</h2>
<div class="outline-text-2" id="text-1">




<pre class="example">(defclass syntax () ())

(defmethod print-object ((object syntax) stream)
  (print-unreadable-object (object stream :type t :identity nil)
    (let ((class (class-of object)))
      (dolist (slotd (c2mop:class-slots class))
        (format stream "~%    ~S: ~S" (c2mop:slot-definition-name slotd)
                (handler-case (c2mop:slot-value-using-class class object slotd)
                  (unbound-slot () '|#&lt;unbound&gt;| )))))))    
</pre>


<p>
A core concept in this syntax is that only headlines and sections are
context-free<sup><a class="footref" name="fnr-Headlines_and_Sections.1" href="#fn-Headlines_and_Sections.1">1</a></sup><sup>, </sup><sup><a class="footref" name="fnr-Headlines_and_Sections.2" href="#fn-Headlines_and_Sections.2">2</a></sup>.  Every other syntactical part only exists
within specific environments.
</p>
<p>
Three categories are used to classify these environments: "Greater
elements", "elements", and "objects", from the broadest scope to the
narrowest.  The word "element" is used for both Greater and non-Greater
elements, the context should make that clear.
</p>
<p>
The paragraph is the unit of measurement.  An element defines
syntactical parts that are at the same level as a paragraph,
i.e. which cannot contain or be included in a paragraph.  An object is
a part that could be included in an element.  Greater elements are all
parts that can contain an element.
</p>



<pre class="example">(defvar *whitespace* '(#\Space #\Tab)) 

(defun .whitespace ()
  (.is 'member *whitespace*))

(defclass whitespace (syntax)
  ((whitespace-prefix :initarg :whitespace-prefix
        :accessor whitespace-prefix)
   (whitespace-postfix :initarg :whitespace-postfix
         :accessor whitespace-postfix)))
</pre>



<pre class="example">(defun .string-of (parser &amp;key (using '.some))
  (coerce (funcall using parser) 'cl:string))  
</pre>



<pre class="example">(defun .line (&amp;optional (nl #\Newline))
  (.prog1 (.coerce (.some (.is-not #'char= nl)) 
                   'cl:string)
          (.is #'char= nl)))
</pre>



<pre class="example">(defstruct until 
  contents end)

(defun .until (parser &amp;key (do (.item)) contents)
  (.let* ((until (.or parser (.result nil))))
    (if until 
        (.result (make-until :contents (reverse contents)
                             :end until))
        (.let* ((first do))
          (.until parser :do do :contents (list* first contents))))))

</pre>


<p>
Empty lines belong to the largest element ending before them.  For
example, in a list, empty lines between items belong are part of the
item before them, but empty lines at the end of a list belong to the
plain list element.
</p>
<p>
Unless specified otherwise, case is not significant.
</p>
</div>

</div>
