parser/org-syntax.org
** Outline package/file
#+HEADER: :padline no
#+BEGIN_SRC lisp :tangle org/outline.lisp :noweb tangle
  (defpackage :smug/parser/org/outline 
    (:use :cl
          :smug/parser/org/dot 
          :smug/parser/org/util
          :smug/parser/org/syntax)
    (:import-from :smug/parser/org/headline 
                  #:.headline
                  #:headline-stars
                  #:headline-level)
    (:import-from :smug/parser/org/section
                  #:.section)
    (:export #:outline
             #:outline-headline
             #:outline-section
             #:outline-start-input
             #:outline-end-input
             #:outline-sub-outlines
             #:.outline))
  (in-package :smug/parser/org/outline)
  
  <<outline>>
  
#+END_SRC

** Headline 
  A headline is defined as:
  
  #+BEGIN_EXAMPLE
  STARS KEYWORD PRIORITY TITLE TAGS
  #+END_EXAMPLE

#+name: headline
#+begin_src lisp
  (defstruct headline 
    stars keyword priority title tags)
  
  (defun headline-level (headline)
    (length (headline-stars headline)))
  
  (defun .headline ()
    (.prog1 
     (.make 
      'make-headline
      :stars (.stars)
      :keyword (.optional (.keyword))
      :priority (.optional (.priority))
      :title (.optional (.title))
      :tags (.optional (.tags)))
     (.some (.is 'char= #\Space))
       (.or  (.not (.item))
             (.is 'char= #\Newline))))
#+end_src 
  
*** STARS

    STARS is a string starting at column 0, containing at least one
    asterisk (and up to ~org-inlinetask-min-level~ if =org-inlinetask=
    library is loaded) and ended by a space character.  The number of
    asterisks is used to define the level of the headline.  It's the
    sole compulsory part of a headline.

   #+name: .stars
   #+begin_src lisp
     (defun .stars ()
       (.prog1 
	(.every (.is 'char= #\*))
	(.is 'char= #\Space)))
   #+end_src

*** KEYWORDS
    
      KEYWORD is a TODO keyword, which has to belong to the list defined in
      ~org-todo-keywords-1~.  Case is significant.

   #+name: todo-keyword
   #+begin_src lisp 
     (defun .keyword () 
       (.prog1 
	(apply #'.or (mapcar #'.string= (org-parameter 'org-todo-keywords-1)))
	(.is #'char= #\Space)))
   #+end_src
   
   #+name: parameters-org-todo-keywords-1
   #+begin_src lisp 
     (define-org-parameter 
       org-todo-keywords-1 
      '("TODO"
	"STARTED"
	"DONE")
      "The Org TODO Keywords")
   #+end_src
      
*** PRIORITY
   PRIORITY is a priority cookie, i.e. a single letter preceded by
   a hash sign # and enclosed within square brackets.

   #+name: .priority
   #+begin_src lisp
     (defun .priority ()
       (.prog2
	(.string= "[#")
	(.is 'alpha-char-p)
	(.string= "] ")))
   #+end_src

*** TITLE  
   TITLE can be made of any character but a new line.  Though, it will
   match after every other part have been matched.
   
   #+name: .title
   #+begin_src lisp 
     (defun .title ()
       (.coerce (.every 
		 (.progn (.not (.tags)) 
			 (.is-not 'char= #\Newline)))
		'cl:string))
   #+end_src

*** TAGS 
    
    TAGS is made of words containing any alpha-numeric character,
    underscore, at sign, hash sign or percent sign, and separated with
    colons.
   
   #+name: .tags
   #+begin_src lisp 
     (defun .tag () 
       (.progn (.is 'char= #\:)
	       (.coerce 
		(.every 
		 (.or (.is 'alphanumericp)
		      (.is 'member '(#\_ #\@ #\# #\%))))
		'cl:string)))
     
     (defun .tags ()
       (.prog1 (.every (.tag))
	       (.is 'char= #\:)))                 
   #+end_src

*** Valid Headlines
   Examples of valid headlines include:

   #+name: TEST-STRING:headline 
   #+BEGIN_SRC org
     ,* 
     
     ,** DONE
     
     ,*** Some e-mail
     
     ,**** TODO [#A] COMMENT Title :tag:a2%: 
   #+END_SRC

*** comments and quotes
     
   If the first word appearing in the title is ~org-comment-string~,
   the headline will be considered as "commented".  If that first word
   is ~org-quote-string~, it will be considered as "quoted".  In both
   situations, case is significant.

   #+name: parameters: org-comment-string
   #+begin_src lisp 
     (make-org-parameter 
      'org-comment-string
      "COMMENT"
      "If the first word appearing in the title is ~org-comment-string~, 
     the headline will be considered as \"commented\"")

   #+end_src

   #+name: parameters: org-quote-string
   #+begin_src lisp 
     (make-org-parameter 
      'org-quote-string 
      "QUOTE"
      "If that first word is ~org-quote-string~, it will be considered as
      \"quoted\"")
   #+end_src

   #+name: org-headline-QUOTE/COMMENT
   #+begin_src lisp
     (flet ((%P (param headline)
	      (.run (.string= (org-parameter param)) 
		    (headline-title headline))))
       
       (defun headline-commented-p (headline) 
	 (%P 'org-comment-string headline))
     
       (defun headline-quoted-p (headline) 
	 (%P 'org-quote-string headline)))
   #+end_src
   
*** footnote-section
   If its title is ~org-footnote-section~, it will be considered as
   a "footnote section".  Case is significant.

   #+name: parameters: org-footnote-section
   #+begin_src lisp 
     (make-org-parameter 
      'org-footnote-section 
      "Footnotes"
      "If its title is ~org-footnote-section~, it will be considered as
   a \"footnote section\"")
   #+end_src

*** archive-tag
   If ~org-archive-tag~ is one of its tags, it will be considered as
   "archived".  Case is significant.

   #+name: parameters: org-archive-tag
   #+begin_src lisp 
     (make-org-parameter 
      'org-archive-tag 
      "ARCHIVE"
      "If ~org-archive-tag~ is one of its tags, it will be considered as
   \"archived\"")
   #+end_src

*** The headline file 

#+HEADER: :padline no
#+BEGIN_SRC lisp :tangle org/headline.lisp :noweb tangle
  (defpackage :smug/parser/org/headline
    (:use :cl 
          :smug/parser/org/dot
          :smug/parser/org/util
          :smug/parser/org/parameters)
    (:export #:.headline
             #:headline
             #:headline-stars
             #:headline-title))
  (in-package :smug/parser/org/headline)
  
  <<headline>>
  
  <<.stars>>
  
  <<todo-keyword>>
  <<.priority>>
  
  <<.title>>
  <<.tags>>
  
  
  <<parameters-org-todo-keywords-1>>
  
#+END_SRC

** Sections 

   A section contains directly any greater element or element.  Only
   a headline can contain a section.  As an exception, text before the
   first headline in the document also belongs to a section.

#+BEGIN_SRC lisp :tangle org/section.lisp
  (defpackage :smug/parser/org/section
    (:use :cl
          :smug/parser/org/dot 
          :smug/parser/org/util
          :smug/parser/org/syntax)
    (:import-from :smug/parser/org/headline 
                  #:.headline)
    (:import-from :smug/parser/org/block 
                            #:.block
                            #:block-name)
    (:export #:section
             #:.section))
  (in-package :smug/parser/org/section)
  
  (defclass section (syntax) 
    ((contents :accessor section-contents 
               :initarg :contents)))
  
  (defun .section-content ()
    (.progn (.not (.headline))
            (.or (.block) (.line))))
  
  (defun find-block (section &key type name number)
    (etypecase section 
      (list (let* ((blocks (remove-if-not (lambda (thing)
                                            (typep thing 'smug/parser/org/block:block))
                                          section))
                   (numbered (when number (nth (1- number) blocks))))
              numbered)
            )))
              
         
  (defun .section 
      (&key 
         (content (.section-content)))
    (.every content))
#+END_SRC

