parser/org-syntax.html

<div id="outline-container-Headlines_and_Sections" class="outline-2">
<h2 id="Headlines_and_Sections"><a name="sec-2" id="sec-2"></a><span class="section-number-2">2</span> Headlines and Sections</h2>
<div class="outline-text-2" id="text-Headlines_and_Sections">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Headline</h3>
<div class="outline-text-3" id="text-2-1">

<p>  A headline is defined as:
</p>



<pre class="example">STARS KEYWORD PRIORITY TITLE TAGS
</pre>


<p>
  (defun .headline ()
    (.let* ((stars <a name="STARS" class="target">STARS</a> )
            (keyword (.optional 
                      <a name="KEYWORD" class="target">KEYWORD</a> ))
            (priority (.optional 
                       <a name="PRIORITY" class="target">PRIORITY</a> ))
            (title (.optional 
                    <a name="TITLE" class="target">TITLE</a> ))
            (tags (.optional 
                   <a name="TAGS" class="target">TAGS</a> )))
      (.prog1 
       (.result (make-headline 
                 :start stars
                 :keyword keyword 
                 :priority priority
                 :title title
                 :tags tags))
       (.some (.is 'char= #\Space))
       (.or  (.not (.item))
             (.is 'char= #\Newline)))))
</p>



<pre class="example">(defstruct headline 
  stars keyword priority title tags)
</pre>



</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> STARS</h4>
<div class="outline-text-4" id="text-2-1-1">


<p>
    STARS is a string starting at column 0, containing at least one
    asterisk (and up to <code>org-inlinetask-min-level</code> if <code>org-inlinetask</code>
    library is loaded) and ended by a space character.  The number of
    asterisks is used to define the level of the headline.  It's the
    sole compulsory part of a headline.
</p>



<pre class="example">(defun .headline/stars ()
  "=&gt; /HEADLINE/ : a [headline]"
  (.make 
   'make-headline
   :stars (.prog1 
           (.every (.is 'char= #\*))
           (.is 'char= #\Space))))
</pre>


</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> KEYWORDS</h4>
<div class="outline-text-4" id="text-2-1-2">


<blockquote>

<p>KEYWORD is a TODO keyword, which has to belong to the list defined in
<code>org-todo-keywords-1</code>.  Case is significant.
</p>
</blockquote>






<pre class="example">(defun .keyword () 
  (.prog1 
   (apply #'.or (mapcar #'.string= (org-parameter 'org-todo-keywords-1)))
   (.is #'char= #\Space)))
</pre>





<pre class="example">(define-org-parameter 
  org-todo-keywords-1 
 '("TODO"
   "STARTED"
   "DONE")
 "The Org TODO Keywords")
</pre>



</div>

</div>

<div id="outline-container-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> PRIORITY</h4>
<div class="outline-text-4" id="text-2-1-3">

<p>   PRIORITY is a priority cookie, i.e. a single letter preceded by
   a hash sign # and enclosed within square brackets.
</p>



<pre class="example">(.prog2
  (.string= "[#")
  (.is 'alpha-char-p)
  (.string= "] "))
</pre>


</div>

</div>

<div id="outline-container-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> TITLE</h4>
<div class="outline-text-4" id="text-2-1-4">

<p>   TITLE can be made of any character but a new line.  Though, it will
   match after every other part have been matched.
</p>



<pre class="example">(.coerce (.every 
 (.progn (.not (.tags)) 
         (.is-not 'char= #\Newline)))
 'cl:string)
</pre>


</div>

</div>

<div id="outline-container-2-1-5" class="outline-4">
<h4 id="sec-2-1-5"><span class="section-number-4">2.1.5</span> TAGS</h4>
<div class="outline-text-4" id="text-2-1-5">

<p>   TAGS is made of words containing any alpha-numeric character,
   underscore, at sign, hash sign or percent sign, and separated with
   colons.
</p>



<pre class="example">(flet ((.tag () (.progn (.is 'char= #\:)
                        (.coerce 
                         (.every 
                          (.or (.is 'alphanumericp)
                               (.is 'member '(#\_ #\@ #\# #\%))))
                          'cl:string))))
  (.let* ((tags (.every (.tag))))
    (.progn (.is 'char= #\:)
            (.result tags))))
</pre>


</div>

</div>

<div id="outline-container-2-1-6" class="outline-4">
<h4 id="sec-2-1-6"><span class="section-number-4">2.1.6</span> Valid Headlines</h4>
<div class="outline-text-4" id="text-2-1-6">

<p>   Examples of valid headlines include:
</p>



<pre class="example">* 

** DONE

*** Some e-mail

**** TODO [#A] COMMENT Title :tag:a2%: 
</pre>


</div>

</div>

<div id="outline-container-2-1-7" class="outline-4">
<h4 id="sec-2-1-7"><span class="section-number-4">2.1.7</span> comments and quotes</h4>
<div class="outline-text-4" id="text-2-1-7">


<p>     
   If the first word appearing in the title is <code>org-comment-string</code>,
   the headline will be considered as "commented".  If that first word
   is <code>org-quote-string</code>, it will be considered as "quoted".  In both
   situations, case is significant.
</p>



<pre class="example">(make-org-parameter 
 'org-comment-string
 "COMMENT"
 "If the first word appearing in the title is ~org-comment-string~, 
the headline will be considered as \"commented\"")

</pre>



<pre class="example">(make-org-parameter 
 'org-quote-string 
 "QUOTE"
 "If that first word is ~org-quote-string~, it will be considered as
 \"quoted\"")
</pre>



<pre class="example">(flet ((%P (param headline)
         (.run (.string= (org-parameter param)) 
               (headline-title headline))))

  (defun headline-commented-p (headline) 
    (%P 'org-comment-string headline))

  (defun headline-quoted-p (headline) 
    (%P 'org-quote-string headline)))
</pre>


</div>

</div>

<div id="outline-container-2-1-8" class="outline-4">
<h4 id="sec-2-1-8"><span class="section-number-4">2.1.8</span> footnote-section</h4>
<div class="outline-text-4" id="text-2-1-8">

<p>   If its title is <code>org-footnote-section</code>, it will be considered as
   a "footnote section".  Case is significant.
</p>



<pre class="example">  (make-org-parameter 
   'org-footnote-section 
   "Footnotes"
   "If its title is ~org-footnote-section~, it will be considered as
a \"footnote section\"")
</pre>


</div>

</div>

<div id="outline-container-2-1-9" class="outline-4">
<h4 id="sec-2-1-9"><span class="section-number-4">2.1.9</span> archive-tag</h4>
<div class="outline-text-4" id="text-2-1-9">

<p>   If <code>org-archive-tag</code> is one of its tags, it will be considered as
   "archived".  Case is significant.
</p>



<pre class="example">  (make-org-parameter 
   'org-archive-tag 
   "ARCHIVE"
   "If ~org-archive-tag~ is one of its tags, it will be considered as
\"archived\"")
</pre>



</div>

</div>

<div id="outline-container-2-1-10" class="outline-4">
<h4 id="sec-2-1-10"><span class="section-number-4">2.1.10</span> The headline file</h4>
<div class="outline-text-4" id="text-2-1-10">





<pre class="example">(defpackage :smug/parser/org/headline
  (:use :cl 
        :smug/parser/org/dot
        :smug/parser/org/util
        :smug/parser/org/parameters)
  (:export #:.headline))
(in-package :smug/parser/org/headline)

&lt;&lt;headline&gt;&gt;

&lt;&lt;.headline/stars&gt;&gt;
&lt;&lt;headline-keywords-comment&gt;&gt;
&lt;&lt;parameters-org-todo-keywords-1&gt;&gt;

</pre>

</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Sections</h3>
<div class="outline-text-3" id="text-2-2">


<p>
  A headline contains directly one section (optionally), followed by
  any number of deeper level headlines.
</p>
<p>
  A section contains directly any greater element or element.  Only
  a headline can contain a section.  As an exception, text before the
  first headline in the document also belongs to a section.
</p>
<p>
