parser/org-syntax.org
*** Quoted
  If a quoted headline contains a section, the latter will be
  considered as a "quote section".

**
  As an example, consider the following document:

  #+BEGIN_SRC org
  An introduction.
  
  ,* A Headline 
  
    Some text.
  
  ,** Sub-Topic 1
  
  ,** Sub-Topic 2
  
  ,*** Additional entry 
  
  ,** QUOTE Another Sub-Topic
  
     Some other text.
  #+END_SRC

  Its internal structure could be summarized as:

  #+BEGIN_EXAMPLE
  (document
   (section)
   (headline
    (section)
    (headline)
    (headline
     (headline))
    (headline
     (quote-section))))
  #+END_EXAMPLE

* Affiliated Keywords
  :PROPERTIES:
  :CUSTOM_ID: Affiliated_keywords
  :END:

  With the exception of [[#Inlinetasks][inlinetasks]], [[#Plain_Lists_and_Items][items]], [[#Clock,_Diary_Sexp_and_Planning][planning]], [[#Clock,_Diary_Sexp_and_Planning][clocks]], [[#Node_Properties][node
  properties]] and [[#Table_Rows][table rows]], every other element type can be assigned
  attributes.

  This is done by adding specific keywords, named "affiliated
  keywords", just above the element considered, no blank line
  allowed.


  #+name: keywords
  #+BEGIN_SRC lisp

    (defclass keywords ()
      ((keywords :initarg :keywords
                 :accessor keywords)))
    
    (defun get-keyword (key keywords)
      (let ((list (etypecase keywords
                    (list keywords)
                    (keywords (keywords keywords)))))
    
        (find key list
              :test 'string-equal 
              :key 'keyword-key)))
  #+END_SRC

  Affiliated keywords are built upon one of the following patterns:
  "#+KEY: VALUE", "#+KEY[OPTIONAL]: VALUE" or "#+ATTR_BACKEND: VALUE".

  #+NAME: keyword
  #+BEGIN_SRC lisp
    (defclass keyword (whitespace)
      ((key :initarg :key
             :accessor keyword-key)
       (value :initarg :value
              :accessor keyword-value)))
         
    (defun .keyword ()
      (.make-instance 
       'keyword
       :whitespace-prefix (.some (.whitespace))
       :key (.progn          
               (.string= "#+")
               (.coerce (.every (.is-not 'char= #\:))
                        'cl:string))
       :value (.progn 
               (.string= ": ")
               (.line))))         
  #+END_SRC
  
  KEY is either "CAPTION", "HEADER", "NAME", "PLOT" or "RESULTS"
  
  #+name: get-keyword-functions 
  #+BEGIN_SRC lisp 
    (defun name (environment)
      (get-keyword "name" environment))      
  #+END_SRC
  
  BACKEND is a string constituted of alpha-numeric characters, hyphens
  or underscores.

  OPTIONAL and VALUE can contain any character but a new line.  Only
  "CAPTION" and "RESULTS" keywords can have an optional value.

  An affiliated keyword can appear more than once if KEY is either
  "CAPTION" or "HEADER" or if its pattern is "#+ATTR_BACKEND: VALUE".

  "CAPTION", "AUTHOR", "DATE" and "TITLE" keywords can contain objects
  in their value and their optional value, if applicable.
  
*** The keyword file 

#+HEADER: :padline no
#+BEGIN_SRC lisp :tangle org/keyword.lisp :noweb tangle
  (defpackage :smug/parser/org/keyword
    (:use :cl 
          :smug/parser/org/dot
          :smug/parser/org/util
          :smug/parser/org/parameters
          :smug/parser/org/syntax)
    (:shadow #:keyword)
    (:export #:keyword 
             #:keywords
             ))
  (in-package :smug/parser/org/keyword)
  
  <<keywords>>

  <<get-keyword-functions>>

  <<keyword>>
  
  
#+END_SRC
  
* Greater Elements
  :PROPERTIES:
  :CUSTOM_ID: Greater_Elements
  :ID:       5762b879-10fc-47ac-b8a9-59007996d49b
  :END:
  
  Unless specified otherwise, greater elements can contain directly
  any other element or greater element excepted:

  - elements of their own type,
  - [[#Node_Properties][node properties]], which can only be found in [[#Drawers_and_Property_Drawers][property drawers]],
  - [[#Plain_Lists_and_Items][items]], which can only be found in [[#Plain_Lists_and_Items][plain lists]].
    
  #+NAME: greater-element
  #+BEGIN_SRC lisp
    (defclass greater-element (whitespace)
      ((keywords :initarg :keywords 
                 :accessor greater-element-keywords)))
    
    (defun .greater-element (.parser)
      (.let* ((keys (.some (.keyword))
              (pre (.some (.whitespace)))
              (element .parser))
        (setf (greater-element-keywords element) keys
              (whitespace-prefix element) pre)
        (.result element)))              
  #+END_SRC

** Greater Blocks
   :PROPERTIES:
   :CUSTOM_ID: Greater_Blocks
   :ID:       14d26d49-9e9b-42db-a9c9-d8e722bb3234
   :END:

   Greater blocks consist in the following pattern:

   #+BEGIN_EXAMPLE
   ,#+BEGIN_NAME PARAMETERS
   CONTENTS
   ,#+END_NAME
   #+END_EXAMPLE

   #+NAME: greater-block-class
   #+BEGIN_SRC lisp :noweb yes
     (defclass greater-block (greater-element)
       ((name :initarg :name
              :accessor greater-block-name)
        (parameters :initarg :parameters
              :accessor greater-block-parameters)
        (contents :initarg :contents
              :accessor greater-block-contents)))
     
   #+END_SRC

   NAME can contain any non-whitespace character.
   
   #+NAME: greater-block-name
   #+BEGIN_SRC lisp
   (defun .name () 
     (.every (.is-not 'member (cons #\Newline *whitespace*)))
   #+END_SRC

   PARAMETERS can contain any character other than new line, and can
   be omitted.

   #+NAME: greater-block-parameters
   #+BEGIN_SRC lisp
   (.progn (.whitespace) (.line))
   #+END_SRC

   If NAME is "CENTER", it will be a "center block".  If it is
   "QUOTE", it will be a "quote block".

   #+NAME: center/quote-block
   #+BEGIN_SRC lisp
     (defclass center-block (greater-block) ())
     
     (add-greater-block "CENTER" 'center-block)
       
     (defclass quote-block (greater-block) ())) 

     (add-greater-block "QUOTE" 'quote-block)
   #+END_SRC

   #+NAME: .greater-block
   #+BEGIN_SRC lisp :noweb :tangle
     (defun .greater-block ()
       (flet ((.end-block (name)
                (.progn (.some (.whitespace))
                        (.string-equal 
                         (concatenate 'string
`                                      "#+END_" name)))))
          
         (.let* ((keywords (.some (.keyword)))
	         (_ (.string-equal "#+BEGIN_"))
                 (name 
                  (.coerce 
                   <<greater-block-name>>
                   'cl:string))
                 (parameters
                  <<greater-block-parameters>>)
                 (contents (.until (.end-block name) 
                                   :do (.line))))
           (.result (make-greater-block-instance 
                     name
		     :keywords keywords
                     :name name
                     :parameters parameters
                     :contents (until-contents 
                                contents))))))
        
   #+END_SRC 

   #+NAME: greater-block-classes
   #+BEGIN_SRC lisp
     (defvar *greater-block-classes* (list))
     
     (defun greater-block-classes ()
       ,*greater-block-classes*)
     
     (defun (setf greater-block-classes) (value)
       (setf *greater-block-classes* value))
     
     (defun add-greater-block (name class)
       (push  (cons name class)
              (greater-block-classes)))
     
     (defun make-greater-block-instance (name &rest initargs)
       (apply #'make-instance 
         (destructuring-bind (_ . maker)
             (or (assoc name (greater-block-classes) 
			:test #'string-equal)
                 (assoc nil (greater-block-classes)))
	   (declare (ignore _))
           maker)            
         initargs))
     
     
     
     
   #+END_SRC

   If the block is neither a center block, a quote block or a [[#Blocks][block
   element]], it will be a "special block".

   #+NAME: special-block
   #+BEGIN_SRC lisp
     (defclass special-block (greater-block) ())
     (add-greater-block nil 'special-block)  
   #+END_SRC
      
   CONTENTS can contain any element, except : a line =#+END_NAME= on
   its own.  Also lines beginning with STARS must be quoted by
   a comma.
   
