parser/org-syntax.html
  If a quoted headline contains a section, the latter will be
  considered as a "quote section".
</p>


<p>
  As an example, consider the following document:
</p>



<pre class="example">An introduction.

* A Headline 

  Some text.

** Sub-Topic 1

** Sub-Topic 2

*** Additional entry 

** QUOTE Another Sub-Topic

   Some other text.
</pre>




  Its internal structure could be summarized as:


<pre class="example">(document
 (section)
 (headline
  (section)
  (headline)
  (headline
   (headline))
  (headline
   (quote-section))))
</pre>


</div>
</div>

</div>

<div id="outline-container-Affiliated_keywords" class="outline-2">
<h2 id="Affiliated_keywords"><a name="sec-3" id="sec-3"></a><span class="section-number-2">3</span> Affiliated Keywords</h2>
<div class="outline-text-2" id="text-Affiliated_keywords">


<p>
  With the exception of <a href="#Inlinetasks">inlinetasks</a>, <a href="#Plain_Lists_and_Items">items</a>, <a href="#Clock-_Diary_Sexp_and_Planning">planning</a>, <a href="#Clock-_Diary_Sexp_and_Planning">clocks</a>, <a href="#Node_Properties">node properties</a> and <a href="#Table_Rows">table rows</a>, every other element type can be assigned
  attributes.
</p>
<p>
  This is done by adding specific keywords, named "affiliated
  keywords", just above the element considered, no blank line
  allowed.
</p>



<pre class="example">(defclass |keyword| (whitespace)
  ((name :initarg :name
         :accessor keyword-name)
   (value :initarg :value
          :accessor keyword-value)))

(defun .keyword ()
  (.make-instance 
   '|keyword|
   :whitespace-prefix (.some (.whitespace))
   :name (.coerce 
          (.progn          
           (.string= "#+")
           (.every (.is-not 'member '(#\Newline #\:))))
          'cl:string)
   :value (.progn 
           (.string= ": ")
           (.line))))

(defun |keywordp| (thing)
  (typep thing '|keyword|))

</pre>


<p>  
  Affiliated keywords are built upon one of the following patterns:
  "#+KEY: VALUE", "#+KEY[OPTIONAL]: VALUE" or "#+ATTR<sub>BACKEND</sub>: VALUE".
</p>
<p>
  KEY is either "CAPTION", "HEADER", "NAME", "PLOT" or "RESULTS"
  string.
</p>



<pre class="example">(.is 'member '("CAPTION" "HEADER" "NAME" "PLOT" "RESULTS")
     :test 'string-equal)

</pre>


<p>  
  BACKEND is a string constituted of alpha-numeric characters, hyphens
  or underscores.
</p>
<p>
  OPTIONAL and VALUE can contain any character but a new line.  Only
  "CAPTION" and "RESULTS" keywords can have an optional value.
</p>
<p>
  An affiliated keyword can appear more than once if KEY is either
  "CAPTION" or "HEADER" or if its pattern is "#+ATTR<sub>BACKEND</sub>: VALUE".
</p>
<p>
  "CAPTION", "AUTHOR", "DATE" and "TITLE" keywords can contain objects
  in their value and their optional value, if applicable.
</p>
</div>

</div>

<div id="outline-container-Greater_Elements" class="outline-2">
<h2 id="Greater_Elements"><a name="sec-4" id="sec-4"></a><a name="ID-5762b879-10fc-47ac-b8a9-59007996d49b" id="ID-5762b879-10fc-47ac-b8a9-59007996d49b"></a><span class="section-number-2">4</span> Greater Elements</h2>
<div class="outline-text-2" id="text-Greater_Elements">


<p>  
  Unless specified otherwise, greater elements can contain directly
  any other element or greater element excepted:
</p>
<ul>
<li>elements of their own type,
</li>
<li><a href="#Node_Properties">node properties</a>, which can only be found in <a href="#Drawers_and_Property_Drawers">property drawers</a>,
</li>
<li><a href="#Plain_Lists_and_Items">items</a>, which can only be found in <a href="#Plain_Lists_and_Items">plain lists</a>.
</li>
</ul>





<pre class="example">(defclass greater-element (whitespace)
  ((keywords :initarg :keywords 
             :accessor greater-element-keywords)))

(defun .greater-element (.parser)
  (.let* ((keys (.some (.keyword)))
          (pre (.some (.whitespace)))
          (element .parser))
    (setf (greater-element-keywords element) keys
          (whitespace-prefix element) pre)
    (.result element)))              
</pre>



</div>

<div id="outline-container-Greater_Blocks" class="outline-3">
<h3 id="Greater_Blocks"><a name="sec-4-1" id="sec-4-1"></a><a name="ID-14d26d49-9e9b-42db-a9c9-d8e722bb3234" id="ID-14d26d49-9e9b-42db-a9c9-d8e722bb3234"></a><span class="section-number-3">4.1</span> Greater Blocks</h3>
<div class="outline-text-3" id="text-Greater_Blocks">


<p>
   Greater blocks consist in the following pattern:
</p>



<pre class="example">#+BEGIN_NAME PARAMETERS
CONTENTS
#+END_NAME
</pre>



<pre class="example">(defclass greater-block (greater-element)
  ((name :initarg :name
         :accessor greater-block-name)
   (parameters :initarg :parameters
         :accessor greater-block-parameters)
   (contents :initarg :contents
         :accessor greater-block-contents)))

</pre>


<p>
   NAME can contain any non-whitespace character.
</p>



<pre class="example">(.every (.is-not 'member (cons #\Newline *whitespace*)))
</pre>


<p>
   PARAMETERS can contain any character other than new line, and can
   be omitted.
</p>



<pre class="example">(.progn (.whitespace) (.line))
</pre>


<p>
   If NAME is "CENTER", it will be a "center block".  If it is
   "QUOTE", it will be a "quote block".
</p>



<pre class="example">(defclass center-block (greater-block) ())

(add-greater-block "CENTER" 'center-block)

(defclass quote-block (greater-block) ())) 

(add-greater-block "QUOTE" 'quote-block)
</pre>



<pre class="example">(defun .greater-block ()
  (flet ((.end-block (name)
           (.progn (.some (.whitespace))
                   (.string-equal 
                    (concatenate 'string
                                 "#+END_" name)))))

    (.let* ((keywords (.some (.keyword)))
            (_ (.string-equal "#+BEGIN_"))
            (name 
             (.coerce 
              &lt;&lt;greater-block-name&gt;&gt;
              'cl:string))
            (parameters
             &lt;&lt;greater-block-parameters&gt;&gt;)
            (contents (.until (.end-block name) 
                              :do (.line))))
      (.result (make-greater-block-instance 
                name
                :keywords keywords
                :name name
                :parameters parameters
                :contents (until-contents 
                           contents))))))

</pre>



<pre class="example">(defvar *greater-block-classes* (list))

(defun greater-block-classes ()
  *greater-block-classes*)

(defun (setf greater-block-classes) (value)
  (setf *greater-block-classes* value))

(defun add-greater-block (name class)
  (push  (cons name class)
         (greater-block-classes)))

(defun make-greater-block-instance (name &amp;rest initargs)
  (apply #'make-instance 
    (destructuring-bind (_ . maker)
        (or (assoc name (greater-block-classes) 
                   :test #'string-equal)
            (assoc nil (greater-block-classes)))
      (declare (ignore _))
      maker)            
    initargs))




</pre>


<p>
   If the block is neither a center block, a quote block or a <a href="#Blocks">block element</a>, it will be a "special block".
</p>



<pre class="example">(defclass special-block (greater-block) ())
(add-greater-block nil 'special-block)  
</pre>


<p>      
   <a href="#CONTENTS">CONTENTS</a> can contain any element, except : a line <code>#+END_NAME</code> on
   its own.  Also lines beginning with STARS must be quoted by
   a comma.
</p>
</div>

</div>
