parser/org-syntax.org
** Drawers and Property Drawers
   :PROPERTIES:
   :CUSTOM_ID: Drawers_and_Property_Drawers
   :END:

   Pattern for drawers is:

   #+BEGIN_EXAMPLE
   :NAME:
   CONTENTS
   :END:
   #+END_EXAMPLE

   NAME has to either be "PROPERTIES" or belong to ~org-drawers~ list.

   If NAME is "PROPERTIES", the drawer will become a "property
   drawer".

   In a property drawers, CONTENTS can only contain [[#Node_Properties][node property]]
   elements.  Otherwise it can contain any element but another drawer
   or property drawer.

   #+ATTR_ASCII: :width 5
   -----

   It would be nice if users hadn't to register drawers names before
   using them in ~org-drawers~ (or through the ~#+DRAWERS:~ keyword).
   Anything starting with ~^[ \t]*:\w+:[ \t]$~ and ending with
   ~^[ \t]*:END:[ \t]$~ could be considered as a drawer.  --- ngz

** Dynamic Blocks
   :PROPERTIES:
   :CUSTOM_ID: Dynamic_Blocks
   :END:

   Pattern for dynamic blocks is:

   #+BEGIN_EXAMPLE
   ,#+BEGIN: NAME PARAMETERS
   CONTENTS
   ,#+END:
   #+END_EXAMPLE

   NAME cannot contain any whitespace character.

   PARAMETERS can contain any character and can be omitted.

** Footnote Definitions
   :PROPERTIES:
   :CUSTOM_ID: Footnote_Definitions
   :END:

   Pattern for footnote definitions is:

   #+BEGIN_EXAMPLE
   [LABEL] CONTENTS
   #+END_EXAMPLE

   It must start at column 0.

   LABEL is either a number or follows the pattern "fn:WORD", where
   word can contain any word-constituent character, hyphens and
   underscore characters.

   CONTENTS can contain any element excepted another footnote
   definition.  It ends at the next footnote definition, the next
   headline, two consecutive empty lines or the end of buffer.

** Inlinetasks
   :PROPERTIES:
   :CUSTOM_ID: Inlinetasks
   :END:

   Inlinetasks are defined by ~org-inlinetask-min-level~ contiguous
   asterisk characters starting at column 0, followed by a whitespace
   character.

   Optionally, inlinetasks can be ended with a string constituted of
   ~org-inlinetask-min-level~ contiguous asterisk characters starting
   at column 0, followed by a space and the "END" string.

   Inlinetasks are recognized only after =org-inlinetask= library is
   loaded.

** Plain Lists and Items
   :PROPERTIES:
   :CUSTOM_ID: Plain_Lists_and_Items
   :END:

   Items are defined by a line starting with the following pattern:
   "BULLET COUNTER-SET CHECK-BOX TAG", in which only BULLET is
   mandatory.

   BULLET is either an asterisk, a hyphen, a plus sign character or
   follows either the pattern "COUNTER." or "COUNTER)".  In any case,
   BULLET is follwed by a whitespace character or line ending.

   COUNTER can be a number or a single letter.

   COUNTER-SET follows the pattern [@COUNTER].

   CHECK-BOX is either a single whitespace character, a "X" character
   or a hyphen, enclosed within square brackets.

   TAG follows "TAG-TEXT ::" pattern, where TAG-TEXT can contain any
   character but a new line.

   An item ends before the next item, the first line less or equally
   indented than its starting line, or two consecutive empty lines.
   Indentation of lines within other greater elements do not count,
   neither do inlinetasks boundaries.

   A plain list is a set of consecutive items of the same indentation.
   It can only directly contain items.

   If first item in a plain list has a counter in its bullet, the
   plain list will be an "ordered plain-list".  If it contains a tag,
   it will be a "descriptive list".  Otherwise, it will be an
   "unordered list".  List types are mutually exclusive.

   For example, consider the following excerpt of an Org document:

   #+BEGIN_EXAMPLE
   1. item 1
   2. [X] item 2
      - some tag :: item 2.1
   #+END_EXAMPLE

   Its internal structure is as follows:

   #+BEGIN_EXAMPLE
   (ordered-plain-list
    (item)
    (item
     (descriptive-plain-list
      (item))))
   #+END_EXAMPLE

** Tables
   :PROPERTIES:
   :CUSTOM_ID: Tables
   :END:

   Tables start at lines beginning with either a vertical bar or the
   "+-" string followed by plus or minus signs only, assuming they are
   not preceded with lines of the same type.  These lines can be
   indented.

   A table starting with a vertical bar has "org" type.  Otherwise it
   has "table.el" type.

   Org tables end at the first line not starting with a vertical bar.
   Table.el tables end at the first line not starting with either
   a vertical line or a plus sign.  Such lines can be indented.

   An org table can only contain table rows.  A table.el table does
   not contain anything.

   One or more "#+TBLFM: FORMULAS" lines, where "FORMULAS" can contain
   any character, can follow an org table.

* Elements
  :PROPERTIES:
  :CUSTOM_ID: Elements
  :END:

  Elements cannot contain any other element.

  Only [[#Keywords][keywords]] whose name belongs to
  ~org-element-document-properties~, [[#Blocks][verse blocks]] , [[#Paragraphs][paragraphs]] and
  [[#Table_Rows][table rows]] can contain objects.

** Babel Call
   :PROPERTIES:
   :CUSTOM_ID: Babel_Call
   :END:

   Pattern for babel calls is:

   #+BEGIN_EXAMPLE
   ,#+CALL: VALUE
   #+END_EXAMPLE

   VALUE is optional.  It can contain any character but a new line.

** Blocks
   :PROPERTIES:
   :CUSTOM_ID: Blocks
   :ID:       618477d5-cb28-4eff-a5ef-cc9b54dc8fb7
   :END:

   Like [[#Greater_Blocks][greater blocks]], pattern for blocks is:

   #+BEGIN_EXAMPLE
   ,#+BEGIN_NAME DATA
   CONTENTS
   ,#+END_NAME
   #+END_EXAMPLE

   #+NAME: block
   #+BEGIN_SRC lisp
     (defclass block (environment keywords)
       ((begin :initarg :begin)
        (name :initarg :name 
              :accessor block-name)
        (data :initarg :data
              :accessor block-data)
        (contents-start-input
         :initarg :contents-start-input
         :accessor block-contents-start-input)
        (contents :initarg :contents
                  :accessor block-contents)
        (contents-end-input
              :initarg :contents-end-input
              :accessor block-contents-end-input)
        (end :initarg :end)
        (start-input :initarg :start-input 
                     :accessor block-start-input)
        (end-input :initarg :end-input
                   :accessor block-end-input)))
   #+END_SRC

*** name 
   NAME cannot contain any whitespace character.
   
   #+NAME: block-name
   #+BEGIN_SRC lisp
     (defun .name () 
       (.string-of (.is-not 'member (cons #\Newline *whitespace*))))
   #+END_SRC
