parser/org-syntax.html

<div id="outline-container-Drawers_and_Property_Drawers" class="outline-3">
<h3 id="Drawers_and_Property_Drawers"><a name="sec-4-2" id="sec-4-2"></a><span class="section-number-3">4.2</span> Drawers and Property Drawers</h3>
<div class="outline-text-3" id="text-Drawers_and_Property_Drawers">


<p>
   Pattern for drawers is:
</p>



<pre class="example">:NAME:
CONTENTS
:END:
</pre>


<p>
   NAME has to either be "PROPERTIES" or belong to <code>org-drawers</code> list.
</p>
<p>
   If NAME is "PROPERTIES", the drawer will become a "property
   drawer".
</p>
<p>
   In a property drawers, <a href="#CONTENTS">CONTENTS</a> can only contain <a href="#Node_Properties">node property</a>
   elements.  Otherwise it can contain any element but another drawer
   or property drawer.
</p>

<hr/>

<p>
   It would be nice if users hadn't to register drawers names before
   using them in <code>org-drawers</code> (or through the <code>#+DRAWERS:</code> keyword).
   Anything starting with <code>^[ \t]*:\w+:[ \t]$</code> and ending with
   <code>^[ \t]*:END:[ \t]$</code> could be considered as a drawer.  &mdash; ngz
</p>
</div>

</div>

<div id="outline-container-Dynamic_Blocks" class="outline-3">
<h3 id="Dynamic_Blocks"><a name="sec-4-3" id="sec-4-3"></a><span class="section-number-3">4.3</span> Dynamic Blocks</h3>
<div class="outline-text-3" id="text-Dynamic_Blocks">


<p>
   Pattern for dynamic blocks is:
</p>



<pre class="example">#+BEGIN: NAME PARAMETERS
CONTENTS
#+END:
</pre>


<p>
   NAME cannot contain any whitespace character.
</p>
<p>
   PARAMETERS can contain any character and can be omitted.
</p>
</div>

</div>

<div id="outline-container-Footnote_Definitions" class="outline-3">
<h3 id="Footnote_Definitions"><a name="sec-4-4" id="sec-4-4"></a><span class="section-number-3">4.4</span> Footnote Definitions</h3>
<div class="outline-text-3" id="text-Footnote_Definitions">


<p>
   Pattern for footnote definitions is:
</p>



<pre class="example">[LABEL] CONTENTS
</pre>


<p>
   It must start at column 0.
</p>
<p>
   LABEL is either a number or follows the pattern "fn:WORD", where
   word can contain any word-constituent character, hyphens and
   underscore characters.
</p>
<p>
   <a href="#CONTENTS">CONTENTS</a> can contain any element excepted another footnote
   definition.  It ends at the next footnote definition, the next
   headline, two consecutive empty lines or the end of buffer.
</p>
</div>

</div>

<div id="outline-container-Inlinetasks" class="outline-3">
<h3 id="Inlinetasks"><a name="sec-4-5" id="sec-4-5"></a><span class="section-number-3">4.5</span> Inlinetasks</h3>
<div class="outline-text-3" id="text-Inlinetasks">


<p>
   Inlinetasks are defined by <code>org-inlinetask-min-level</code> contiguous
   asterisk characters starting at column 0, followed by a whitespace
   character.
</p>
<p>
   Optionally, inlinetasks can be ended with a string constituted of
   <code>org-inlinetask-min-level</code> contiguous asterisk characters starting
   at column 0, followed by a space and the "END" string.
</p>
<p>
   Inlinetasks are recognized only after <code>org-inlinetask</code> library is
   loaded.
</p>
</div>

</div>

<div id="outline-container-Plain_Lists_and_Items" class="outline-3">
<h3 id="Plain_Lists_and_Items"><a name="sec-4-6" id="sec-4-6"></a><span class="section-number-3">4.6</span> Plain Lists and Items</h3>
<div class="outline-text-3" id="text-Plain_Lists_and_Items">


<p>
   Items are defined by a line starting with the following pattern:
   "BULLET COUNTER-SET CHECK-BOX TAG", in which only BULLET is
   mandatory.
</p>
<p>
   BULLET is either an asterisk, a hyphen, a plus sign character or
   follows either the pattern "COUNTER." or "COUNTER)".  In any case,
   BULLET is follwed by a whitespace character or line ending.
</p>
<p>
   COUNTER can be a number or a single letter.
</p>
<p>
   COUNTER-SET follows the pattern [@COUNTER].
</p>
<p>
   CHECK-BOX is either a single whitespace character, a "X" character
   or a hyphen, enclosed within square brackets.
</p>
<p>
   TAG follows "TAG-TEXT ::" pattern, where TAG-TEXT can contain any
   character but a new line.
</p>
<p>
   An item ends before the next item, the first line less or equally
   indented than its starting line, or two consecutive empty lines.
   Indentation of lines within other greater elements do not count,
   neither do inlinetasks boundaries.
</p>
<p>
   A plain list is a set of consecutive items of the same indentation.
   It can only directly contain items.
</p>
<p>
   If first item in a plain list has a counter in its bullet, the
   plain list will be an "ordered plain-list".  If it contains a tag,
   it will be a "descriptive list".  Otherwise, it will be an
   "unordered list".  List types are mutually exclusive.
</p>
<p>
   For example, consider the following excerpt of an Org document:
</p>



<pre class="example">1. item 1
2. [X] item 2
   - some tag :: item 2.1
</pre>


<p>
   Its internal structure is as follows:
</p>



<pre class="example">(ordered-plain-list
 (item)
 (item
  (descriptive-plain-list
   (item))))
</pre>


</div>

</div>

<div id="outline-container-Tables" class="outline-3">
<h3 id="Tables"><a name="sec-4-7" id="sec-4-7"></a><span class="section-number-3">4.7</span> Tables</h3>
<div class="outline-text-3" id="text-Tables">


<p>
   Tables start at lines beginning with either a vertical bar or the
   "+-" string followed by plus or minus signs only, assuming they are
   not preceded with lines of the same type.  These lines can be
   indented.
</p>
<p>
   A table starting with a vertical bar has "org" type.  Otherwise it
   has "table.el" type.
</p>
<p>
   Org tables end at the first line not starting with a vertical bar.
   Table.el tables end at the first line not starting with either
   a vertical line or a plus sign.  Such lines can be indented.
</p>
<p>
   An org table can only contain table rows.  A table.el table does
   not contain anything.
</p>
<p>
   One or more "#+TBLFM: FORMULAS" lines, where "FORMULAS" can contain
   any character, can follow an org table.
</p>
</div>
</div>

</div>

<div id="outline-container-Elements" class="outline-2">
<h2 id="Elements"><a name="sec-5" id="sec-5"></a><span class="section-number-2">5</span> Elements</h2>
<div class="outline-text-2" id="text-Elements">


<p>
  Elements cannot contain any other element.
</p>
<p>
  Only <a href="#Keywords">keywords</a> whose name belongs to
  <code>org-element-document-properties</code>, <a href="#Blocks">verse blocks</a> , <a href="#Paragraphs">paragraphs</a> and
  <a href="#Table_Rows">table rows</a> can contain objects.
</p>

</div>

<div id="outline-container-Babel_Call" class="outline-3">
<h3 id="Babel_Call"><a name="sec-5-1" id="sec-5-1"></a><span class="section-number-3">5.1</span> Babel Call</h3>
<div class="outline-text-3" id="text-Babel_Call">


<p>
   Pattern for babel calls is:
</p>



<pre class="example">#+CALL: VALUE
</pre>


<p>
   VALUE is optional.  It can contain any character but a new line.
</p>
</div>

</div>

<div id="outline-container-Blocks" class="outline-3">
<h3 id="Blocks"><a name="sec-5-2" id="sec-5-2"></a><a name="ID-618477d5-cb28-4eff-a5ef-cc9b54dc8fb7" id="ID-618477d5-cb28-4eff-a5ef-cc9b54dc8fb7"></a><span class="section-number-3">5.2</span> Blocks</h3>
<div class="outline-text-3" id="text-Blocks">


<p>
   Like <a href="#Greater_Blocks">greater blocks</a>, pattern for blocks is:
</p>



<pre class="example">#+BEGIN_NAME DATA
CONTENTS
#+END_NAME
</pre>



<pre class="example">(defclass element-block (greater-block) 
 ((name :accessor element-block-name)
  (parameters :initarg :parameters
              :accessor element-block-data)
  (contents :initarg :contents
            :accessor element-block-contents)))

</pre>


<p>
   NAME cannot contain any whitespace character.
</p>
<p>   
