parser/org-syntax.org
*** block content and end block

   DATA can contain any character but a new line.  It can be ommitted,
   unless the block is a "source block".  

   CONTENTS can contain any element, except : a line =#+END_NAME= on
   its own.  Also lines beginning with STARS must be quoted by
   a comma.

   #+name: block-contents
   #+BEGIN_SRC lisp
     (defun .end-block (name)
       (.let* ((prefix (.string-of (.whitespace)))
               (end (.string-equal 
                     (concatenate 
                      'string  "#+END_" name))))
         (.result (concatenate 'string prefix end))))
                      
     (defun .block ()
       (.let* ((start-input (.input))
               (pre (.some (.whitespace)))
               (begin (.string-equal "#+BEGIN_"))
               (keywords (.some (.keyword)))
               (name (.name))
               (data (.prog2 (.is 'char= #\Space)
                             (.string-of (.is-not 'char= #\Newline))
                             (.is 'char= #\Newline)))
               (contents-start-input (.input))
               (contents.input.end (.until 
                                    (.let* ((eip (.input))
                                            (end
                                             (.end-block name)))
                                      (.result (cons eip end)))
                                   :do (.line)))
               (post (.some (.is-not 'char= #\Newline)))
               (end-input (.input)))
         (.result 
          (make-instance 
          (or (block-class name) 'block)
          :start-input start-input
          :whitespace-prefix pre
          :begin begin
          :keywords keywords
          :name name
          :data data
          :contents-start-input contents-start-input
          :contents (car contents.input.end)
          :contents-end-input (cadr contents.input.end)
          :end (cddr contents.input.end)
          :whitespace-postfix post
          :end-input end-input))))
        
   #+END_SRC

*** Different Block Types

   If NAME is "COMMENT", it will be a "comment block".  If it is
   "EXAMPLE", it will be an "example block".  If it is "SRC", it will
   be a "source block".  If it is "VERSE", it will be a "verse block".

   CONTENTS can contain any character, including new lines.  Though it
   will only contain Org objects if the block is a verse block.
   Otherwise, contents will not be parsed.
   
   #+name: block-classes
   #+BEGIN_SRC lisp
     (defvar *block-classes* (list))
     
     (defun add-block (name class)
       (pushnew (cons name class)
                ,*block-classes* 
                :test #'equalp))
     
     (defun block-class (name)
       (cdr (assoc name *block-classes* 
                   :test #'string-equal)))
        
   #+END_SRC

   #+NAME: add-element-blocks
   #+BEGIN_SRC lisp :noweb tangle
     (defclass comment-block (block) ())
     (add-block "COMMENT" 'comment-block)
     
     (defclass example-block (block) ())
     (add-block "EXAMPLE" 'example-block)
     
     (defclass verse-block (block) ())
     (add-block "VERSE" 'verse-block)     
   #+END_SRC

   If NAME is a string matching the name of any export back-end
   loaded, the block will be an "export block".
   
*** Source Block 
    
    In this case, DATA must follow
    the pattern "LANGUAGE SWITCHES ARGUMENTS", where SWITCHES and
    ARGUMENTS are optional.

   #+NAME: source-block
   #+BEGIN_SRC lisp :noweb :tangle   
     (defclass source-block (block)
       ((language :initarg :language 
                  :accessor source-block-language)
        (switches :initarg :switches 
                  :accessor source-block-switches)
        (arguments :initarg :arguments 
                   :accessor source-block-arguments)))     
     
     (add-block "SRC" 'source-block) 
   #+END_SRC
**** Language
   LANGUAGE cannot contain any whitespace character
.
   #+NAME: source-block-language
   #+BEGIN_SRC lisp 
     (defun .language () 
       (.string-of (.is-not 'member (cons #\Newline *whitespace*))))
   #+END_SRC

**** TODO Switches

   SWITCHES is made of any number of "SWITCH" patterns, separated by
   blank lines.

   A SWITCH pattern is either "-l "FORMAT"", where FORMAT can contain
   any character but a double quote and a new line, "-S" or "+S",
   where S stands for a single letter.

   #+NAME: source-block-switches
   #+BEGIN_SRC lisp 
     (defun .switches () 
       ;; TODO
       (.result nil))
   #+END_SRC

**** Arguments

   ARGUMENTS can contain any character but a new line.

   #+NAME: source-block-arguments
   #+BEGIN_SRC lisp
     (defun .arguments () 
      (.optional (.string-of (.is-not 'eql #\Newline))))
   #+END_SRC

**** Initialise the source-block instance

   #+NAME: source-block-initialize
   #+BEGIN_SRC lisp     
     (defmethod initialize-instance :after ((source-block source-block)
                                            &rest initargs)
       (declare (ignore initargs))
       (.run 
          (.let* ((language (.language))
                  (_ (.optional (.is 'eql #\Space)))
                  (switches (.switches))
                  (_ (.optional (.is 'eql #\Space)))
                  (arguments (.arguments)))
            (with-accessors ((l source-block-language)
                             (s source-block-switches)
                             (a source-block-arguments)) 
                source-block
              (.result (setf l language
                             s switches
                             a arguments))))
          (block-data source-block)))
   #+END_SRC
   
**** SRC block package/file 

   #+BEGIN_SRC lisp :tangle org/source-block.lisp :noweb tangle :padline no
     (defpackage :smug/parser/org/source-block
       (:use :cl 
             :smug/parser/org/dot
             :smug/parser/org/util
             :smug/parser/org/parameters
             :smug/parser/org/syntax
             :smug/parser/org/environment)
       (:import-from :smug/parser/org/keyword
                     #:.keyword
                     #:keywords)
       (:shadowing-import-from :smug/parser/org/block 
                               #:block #:add-block #:block-data)
       (:export #:source-block
                #:source-block-language))
     (in-package :smug/parser/org/source-block)
     
     <<source-block>>
     
     <<source-block-language>>
     
     <<source-block-switches>>
     
     <<source-block-arguments>>
     
     <<source-block-initialize>>
   #+END_SRC
*** Block package/file 

   #+BEGIN_SRC lisp :tangle org/block.lisp :noweb tangle :padline no
     (defpackage :smug/parser/org/block
       (:use :cl 
             :smug/parser/org/dot
             :smug/parser/org/util
             :smug/parser/org/parameters
             :smug/parser/org/syntax
             :smug/parser/org/environment)
       (:import-from :smug/parser/org/keyword
                     #:.keyword
                     #:keywords)
       (:shadow #:block)
       (:export #:block
                #:block-contents
                #:.block
                #:add-block
                #:comment-block
                #:verse-block
                #:example-block))
     (in-package :smug/parser/org/block)
     
     <<block>>
     
     <<block-name>>
     
     <<block-contents>>
        
     <<block-classes>>
     
     <<add-element-blocks>>
   #+END_SRC
** Clock, Diary Sexp and Planning
   :PROPERTIES:
   :CUSTOM_ID: Clock,_Diary_Sexp_and_Planning
   :END:

   A clock follows the pattern:
   
   #+BEGIN_EXAMPLE
   CLOCK: TIMESTAMP DURATION
   #+END_EXAMPLE

   Both TIMESTAMP and DURATION are optional.

   TIMESTAMP is a [[#Timestamp][timestamp]] object.

   DURATION follows the pattern:

   #+BEGIN_EXAMPLE
   => HH:MM
   #+END_EXAMPLE

   HH is a number containing any number of digits.  MM is a two digit
   numbers.

   A diary sexp is a line starting at column 0 with "%%(" string.  It
   can then contain any character besides a new line.

   A planning is a line filled with more at most three INFO parts,
   where each INFO part follows the pattern:

   #+BEGIN_EXAMPLE
   KEYWORD: TIMESTAMP
   #+END_EXAMPLE

   KEYWORD is a string among ~org-deadline-string~,
   ~org-scheduled-string~ and ~org-closed-string~.  TIMESTAMP is is
   a [[#Timestamp][timestamp]] object.

   Even though a planning element can exist anywhere in a section or
   a greater element, it will only affect the headline containing the
   section if it is put on the line following that headline.

** Comments
   :PROPERTIES:
   :CUSTOM_ID: Comments
   :END:

   A "comment line" starts with a hash signe and a whitespace
   character or an end of line.

   Comments can contain any number of consecutive comment lines.

** Fixed Width Areas
   :PROPERTIES:
   :CUSTOM_ID: Fixed_Width_Areas
   :END:

   A "fixed-width line" start with a colon character and a whitespace
   or an end of line.

   Fixed width areas can contain any number of consecutive fixed-width
   lines.

** Horizontal Rules
   :PROPERTIES:
   :CUSTOM_ID: Horizontal_Rules
   :END:

   A horizontal rule is a line made of at least 5 consecutive hyphens.
   It can be indented.

** Keywords

   Keywords follow the syntax:

   #+BEGIN_EXAMPLE
   ,#+KEY: VALUE
   #+END_EXAMPLE

   KEY can contain any non-whitespace character, but it cannot be
   equal to "CALL" or any affiliated keyword.

   VALUE can contain any character excepted a new line.

   If KEY belongs to ~org-element-document-properties~, VALUE can
   contain objects.

