parser/org-syntax.html
   If NAME is "COMMENT", it will be a "comment block".  If it is
   "EXAMPLE", it will be an "example block".  If it is "SRC", it will
   be a "source block".  If it is "VERSE", it will be a "verse block".
</p>



<pre class="example">(defclass comment-block (element-block) ())
(add-greater-block "COMMENT" 'comment-block)

(defclass example-block (element-block) ())
(add-greater-block "EXAMPLE" 'example-block)

(defclass verse-block (element-block) ())
(add-greater-block "VERSE" 'verse-block)  

(defclass source-block (element-block) 
  &lt;&lt;source-block-slots&gt;&gt;)     
(add-greater-block "SRC" 'source-block)
</pre>


<p>
   If NAME is a string matching the name of any export back-end
   loaded, the block will be an "export block".
</p>
<p>
   DATA can contain any character but a new line.  It can be ommitted,
   unless the block is a "source block".  In this case, it must follow
   the pattern "LANGUAGE SWITCHES ARGUMENTS", where SWITCHES and
   ARGUMENTS are optional.
</p>



<pre class="example">((language :initarg :language 
          :accessor source-block-language)
 (switches :initarg :switches 
           :accessor source-block-switches)
 (arguments :initarg :arguments 
            :accessor source-block-arguments))    
</pre>


<p>
   LANGUAGE cannot contain any whitespace character
.
</p>


<pre class="example">(.every (.is-not 'member (cons #\Newline *whitespace*))) 
</pre>


<p>
   SWITCHES is made of any number of "SWITCH" patterns, separated by
   blank lines.
</p>
<p>
   A SWITCH pattern is either "-l "FORMAT"", where FORMAT can contain
   any character but a double quote and a new line, "-S" or "+S",
   where S stands for a single letter.
</p>
<p>
   ARGUMENTS can contain any character but a new line.
</p>



<pre class="example">(.optional (.every (.is-not 'eql #\Newline)))
</pre>



<pre class="example">
(defmethod initialize-instance :after ((source-block source-block)
                                       &amp;rest initargs)
  (declare (ignore initargs))
  (flet ((.data ()
           (.let* ((language 
                    &lt;&lt;source-block-language&gt;&gt;)
                   (switches (.result nil))
                   (_ (.optional (.is 'eql #\Space)))
                   (arguments 
                    &lt;&lt;source-block-arguments&gt;&gt;))
             (with-accessors ((l source-block-language)
                              (s source-block-switches)
                              (a source-block-arguments)) 
                 source-block
               (.result (setf l (coerce language 'cl:string)
                              s switches
                              a (coerce arguments 'cl:string)))))))
    (.run (.data) (element-block-data source-block))))

</pre>


<p>   
   <a href="#CONTENTS">CONTENTS</a> can contain any character, including new lines.  Though it
   will only contain Org objects if the block is a verse block.
   Otherwise, <a href="#contents">contents</a> will not be parsed.
</p>
</div>

</div>

<div id="outline-container-Clock-_Diary_Sexp_and_Planning" class="outline-3">
<h3 id="Clock-_Diary_Sexp_and_Planning"><a name="sec-5-3" id="sec-5-3"></a><span class="section-number-3">5.3</span> Clock, Diary Sexp and Planning</h3>
<div class="outline-text-3" id="text-Clock-_Diary_Sexp_and_Planning">


<p>
   A clock follows the pattern:
</p>



<pre class="example">CLOCK: TIMESTAMP DURATION
</pre>


<p>
   Both TIMESTAMP and DURATION are optional.
</p>
<p>
   TIMESTAMP is a <a href="#Timestamp">timestamp</a> object.
</p>
<p>
   DURATION follows the pattern:
</p>



<pre class="example">=&gt; HH:MM
</pre>


<p>
   HH is a number containing any number of digits.  MM is a two digit
   numbers.
</p>
<p>
   A diary sexp is a line starting at column 0 with "%%(" string.  It
   can then contain any character besides a new line.
</p>
<p>
   A planning is a line filled with more at most three INFO parts,
   where each INFO part follows the pattern:
</p>



<pre class="example">KEYWORD: TIMESTAMP
</pre>


<p>
   KEYWORD is a string among <code>org-deadline-string</code>,
   <code>org-scheduled-string</code> and <code>org-closed-string</code>.  TIMESTAMP is is
   a <a href="#Timestamp">timestamp</a> object.
</p>
<p>
   Even though a planning element can exist anywhere in a section or
   a greater element, it will only affect the headline containing the
   section if it is put on the line following that headline.
</p>
</div>

</div>

<div id="outline-container-Comments" class="outline-3">
<h3 id="Comments"><a name="sec-5-4" id="sec-5-4"></a><span class="section-number-3">5.4</span> Comments</h3>
<div class="outline-text-3" id="text-Comments">


<p>
   A "comment line" starts with a hash signe and a whitespace
   character or an end of line.
</p>
<p>
   Comments can contain any number of consecutive comment lines.
</p>
</div>

</div>

<div id="outline-container-Fixed_Width_Areas" class="outline-3">
<h3 id="Fixed_Width_Areas"><a name="sec-5-5" id="sec-5-5"></a><span class="section-number-3">5.5</span> Fixed Width Areas</h3>
<div class="outline-text-3" id="text-Fixed_Width_Areas">


<p>
   A "fixed-width line" start with a colon character and a whitespace
   or an end of line.
</p>
<p>
   Fixed width areas can contain any number of consecutive fixed-width
   lines.
</p>
</div>

</div>

<div id="outline-container-Horizontal_Rules" class="outline-3">
<h3 id="Horizontal_Rules"><a name="sec-5-6" id="sec-5-6"></a><span class="section-number-3">5.6</span> Horizontal Rules</h3>
<div class="outline-text-3" id="text-Horizontal_Rules">


<p>
   A horizontal rule is a line made of at least 5 consecutive hyphens.
   It can be indented.
</p>
</div>

</div>

<div id="outline-container-Keywords" class="outline-3">
<h3 id="Keywords"><a name="sec-5-7" id="sec-5-7"></a><span class="section-number-3">5.7</span> Keywords</h3>
<div class="outline-text-3" id="text-Keywords">


<p>
   Keywords follow the syntax:
</p>



<pre class="example">#+KEY: VALUE
</pre>


<p>
   KEY can contain any non-whitespace character, but it cannot be
   equal to "CALL" or any affiliated keyword.
</p>
<p>
   VALUE can contain any character excepted a new line.
</p>
<p>
   If KEY belongs to <code>org-element-document-properties</code>, VALUE can
   contain objects.
</p>
</div>

</div>
