parser/org-syntax.html

<div id="outline-container-LaTeX_Environments" class="outline-3">
<h3 id="LaTeX_Environments"><a name="sec-5-8" id="sec-5-8"></a><span class="section-number-3">5.8</span> LaTeX Environments</h3>
<div class="outline-text-3" id="text-LaTeX_Environments">


<p>
   Pattern for LaTeX environments is:
</p>



<pre class="example">\begin{NAME}
CONTENTS
\end{NAME}
</pre>


<p>
   NAME is constituted of alpha-numeric characters and may end with an
   asterisk.
</p>
<p>
   <a href="#CONTENTS">CONTENTS</a> can contain anything but the "\end{NAME}" string.
</p>
</div>

</div>

<div id="outline-container-Node_Properties" class="outline-3">
<h3 id="Node_Properties"><a name="sec-5-9" id="sec-5-9"></a><span class="section-number-3">5.9</span> Node Properties</h3>
<div class="outline-text-3" id="text-Node_Properties">


<p>
   Patter for node properties is:
</p>



<pre class="example">:PROPERTY: VALUE
</pre>


<p>
   PROPERTY can contain any non-whitespace character.  VALUE can
   contain any character but a new line.
</p>
<p>
   Node properties can only exist in a <a href="#Drawers_and_Property_Drawers">property drawers</a>.
</p>
</div>

</div>

<div id="outline-container-Paragraphs" class="outline-3">
<h3 id="Paragraphs"><a name="sec-5-10" id="sec-5-10"></a><span class="section-number-3">5.10</span> Paragraphs</h3>
<div class="outline-text-3" id="text-Paragraphs">


<p>
   Paragraphs are the default element, which means that any
   unrecognized context is a paragraph.
</p>
<p>
   Empty lines and other elements end paragraphs.
</p>
<p>
   Paragraphs can contain every type of object.
</p>
</div>

</div>

<div id="outline-container-Table_Rows" class="outline-3">
<h3 id="Table_Rows"><a name="sec-5-11" id="sec-5-11"></a><span class="section-number-3">5.11</span> Table Rows</h3>
<div class="outline-text-3" id="text-Table_Rows">


<p>
   A table rows is either constituted of a vertical bar and any number
   of <a href="#Table_Cells">table cells</a> or a vertical bar followed by a hyphen.
</p>
<p>
   In the first case the table row has the "standard" type.  In the
   second case, it has the "rule" type.
</p>
<p>
   Table rows can only exist in <a href="#Tables">tables</a>.
</p>
</div>
</div>

</div>

<div id="outline-container-Objects" class="outline-2">
<h2 id="Objects"><a name="sec-6" id="sec-6"></a><span class="section-number-2">6</span> Objects</h2>
<div class="outline-text-2" id="text-Objects">


<p>
  Objects can only be found in the following locations:
</p>
<ul>
<li><a href="#Affiliated_keywords">affiliated keywords</a> defined in <code>org-element-parsed-keywords</code>,
</li>
<li><a href="#Keywords">document properties</a>,
</li>
<li><a href="#Headlines_and_Sections">headline</a> titles,
</li>
<li><a href="#Inlinetasks">inlinetask</a> titles,
</li>
<li><a href="#Plain_Lists_and_Items">item</a> tags,
</li>
<li><a href="#Paragraphs">paragraphs</a>,
</li>
<li><a href="#Table_Cells">table cells</a>,
</li>
<li><a href="#Table_Rows">table rows</a>, which can only contain table cell
    objects,
</li>
<li><a href="#Blocks">verse blocks</a>.
</li>
</ul>


<p>    
  Most objects cannot contain objects.  Those which can will be
  specified.
</p>

</div>

<div id="outline-container-Entities_and_LaTeX_Fragments" class="outline-3">
<h3 id="Entities_and_LaTeX_Fragments"><a name="sec-6-1" id="sec-6-1"></a><span class="section-number-3">6.1</span> Entities and LaTeX Fragments</h3>
<div class="outline-text-3" id="text-Entities_and_LaTeX_Fragments">


<p>
   An entity follows the pattern:
</p>



<pre class="example">\NAME POST
</pre>


<p>
   where NAME has a valid association in either <code>org-entities</code> or
   <code>org-entities-user</code>.
</p>
<p>
   POST is the end of line, "{}" string, or a non-alphabetical
   character.  It isn't separated from NAME by a whitespace character.
</p>
<p>
   A LaTeX fragment can follow multiple patterns:
</p>



<pre class="example">\NAME POST
\(CONTENTS\)
\[CONTENTS\]
$$CONTENTS$$
PRE$CHAR$POST
PRE$BORDER1 BODY BORDER2$
</pre>


<p>
   NAME contains alphabetical characters only and must not have an
   association in either <code>org-entities</code> or <code>org-entities-user</code>.
</p>
<p>
   POST is the same as for entities.
</p>
<p>
   <a href="#CONTENTS">CONTENTS</a> can contain any character but cannot contain "\)" in the
   second template or "\]" in the third one.
</p>
<p>
   PRE is either the beginning of line or a character different from
   <code>$</code>.
</p>
<p>
   CHAR is a non-whitespace character different from <code>.</code>, ~,~, <code>?</code>,
   <code>;</code>, ~'~ or a double quote.
</p>
<p>
   POST is any of <code>-</code>, <code>.</code>, ~,~, <code>?</code>, <code>;</code>, <code>:</code>, ~'~, a double quote,
   a whitespace character and the end of line.
</p>
<p>
   BORDER1 is a non-whitespace character different from <code>.</code>, <code>;</code>, <code>.</code>
   and <code>$</code>.
</p>
<p>
   BODY can contain any character excepted <code>$</code>, and may not span over
   more than 3 lines.
</p>
<p>
   BORDER2 is any non-whitespace character different from ~,~, <code>.</code> and
   <code>$</code>.
</p>

<hr/>

<blockquote>

<p>It would introduce incompatibilities with previous Org versions,
but support for <code>$...$</code> (and for symmetry, <code>$$...$$</code>) constructs
ought to be removed.
</p>
<p>
They are slow to parse, fragile, redundant and imply false
positives.  &mdash; ngz
</p>
</blockquote>


</div>

</div>

<div id="outline-container-Export_Snippets" class="outline-3">
<h3 id="Export_Snippets"><a name="sec-6-2" id="sec-6-2"></a><span class="section-number-3">6.2</span> Export Snippets</h3>
<div class="outline-text-3" id="text-Export_Snippets">


<p>
   Patter for export snippets is:
</p>



<pre class="example">@@NAME:VALUE@@
</pre>


<p>
   NAME can contain any alpha-numeric character and hyphens.
</p>
<p>
   VALUE can contain anything but "@@" string.
</p>
</div>

</div>

<div id="outline-container-Footnote_References" class="outline-3">
<h3 id="Footnote_References"><a name="sec-6-3" id="sec-6-3"></a><span class="section-number-3">6.3</span> Footnote References</h3>
<div class="outline-text-3" id="text-Footnote_References">


<p>
   There are four patterns for footnote references:
</p>



<pre class="example">[MARK]
[fn:LABEL]
[fn:LABEL:DEFINITION]
[fn::DEFINITION]
</pre>


<p>
   MARK is a number.
</p>
<p>
   LABEL can contain any word constituent character, hyphens and
   underscores.
</p>
<p>
   DEFINITION can contain any character.  Though opening and closing
   square brackets must be balanced in it.  It can contain any object
   encountered in a paragraph, even other footnote references.
</p>
<p>
   If the reference follows the third pattern, it is called an "inline
   footnote".  If it follows the fourth one, i.e. if LABEL is omitted,
   it is an "anonymous footnote".
</p>
</div>

</div>

<div id="outline-container-Inline_Babel_Calls_and_Source_Blocks" class="outline-3">
<h3 id="Inline_Babel_Calls_and_Source_Blocks"><a name="sec-6-4" id="sec-6-4"></a><span class="section-number-3">6.4</span> Inline Babel Calls and Source Blocks</h3>
<div class="outline-text-3" id="text-Inline_Babel_Calls_and_Source_Blocks">


<p>
   Inline Babel calls follow any of the following patterns:
</p>



<pre class="example">call_NAME(ARGUMENTS)
call_NAME[HEADER](ARGUMENTS)[HEADER]
</pre>


<p>
   NAME can contain any character besides <code>(</code>, <code>)</code> and "\n".
</p>
<p>
   HEADER can contain any character besides <code>]</code> and "\n".
</p>
<p>
   ARGUMENTS can contain any character besides <code>)</code> and "\n".
</p>
<p>
   Inline source blocks follow any of the following patterns:
</p>



<pre class="example">src_LANG{BODY}
src_LANG[OPTIONS]{BODY}
</pre>


<p>
   LANG can contain any non-whitespace character.
</p>
<p>
   OPTIONS and BODY can contain any character but "\n".
</p>
</div>

</div>

<div id="outline-container-Line_Breaks" class="outline-3">
<h3 id="Line_Breaks"><a name="sec-6-5" id="sec-6-5"></a><span class="section-number-3">6.5</span> Line Breaks</h3>
<div class="outline-text-3" id="text-Line_Breaks">


<p>
   A line break consists in "\\SPACE" pattern at the end of an
   otherwise non-empty line.
</p>
<p>
   SPACE can contain any number of tabs and spaces, including 0.
</p>
</div>

</div>
