parser/org-syntax.html

<div id="outline-container-Links" class="outline-3">
<h3 id="Links"><a name="sec-6-6" id="sec-6-6"></a><span class="section-number-3">6.6</span> Links</h3>
<div class="outline-text-3" id="text-Links">


<p>
   There are 4 major types of links:
</p>



<pre class="example">RADIO                     ("radio" link)
&lt;PROTOCOL:PATH&gt;           ("angle" link)
PRE PROTOCOL:PATH2 POST   ("plain" link)
[[PATH3]DESCRIPTION]      ("regular" link)
</pre>


<p>
   RADIO is a string matched by some <a href="#Targets_and_Radio_Targets">radio target</a>.  It can contain
   <a href="#Entities_and_LaTeX_Fragments">entities</a>, <a href="#Entities_and_LaTeX_Fragments">latex fragments</a>, <a href="#Subscript_and_Superscript">subscript</a> and <a href="#Subscript_and_Superscript">superscript</a> only.
</p>
<p>
   PROTOCOL is a string among <code>org-link-types</code>.
</p>
<p>
   PATH can contain any character but <code>]</code>, <code>&lt;</code>, <code>&gt;</code> and <code>\n</code>.
</p>
<p>
   PRE and POST are non word constituent.  They can be, respectively,
   the beginning or the end of a line.
</p>
<p>
   PATH2 can contain any non-whitespace character excepted <code>(</code>, <code>)</code>,
   <code>&lt;</code> and <code>&gt;</code>.  It must end with a word-constituent character, or any
   non-whitespace non-punctuation character followed by <code>/</code>.
</p>
<p>
   DESCRIPTION must be enclosed within square brackets.  It can
   contain any character but square brackets.  Object-wise, it can
   contain any object found in a paragraph excepted a <a href="#Footnote_References">footnote reference</a>, a <a href="#Targets_and_Radio_Targets">radio target</a> and a <a href="#Line_Breaks">line break</a>.  It cannot contain
   another link either, unless it is a plain link.
</p>
<p>
   DESCRIPTION is optional.
</p>
<p>
   PATH3 is built according to the following patterns:
</p>



<pre class="example">FILENAME           ("file" type)
PROTOCOL:PATH4     ("PROTOCOL" type)
id:ID              ("id" type)
#CUSTOM-ID         ("custom-id" type)
(CODEREF)          ("coderef" type)
FUZZY              ("fuzzy" type)
</pre>


<p>
   FILENAME is a file name, either absolute or relative.
</p>
<p>
   PATH4 can contain any character besides square brackets.
</p>
<p>
   ID is constituted of hexadecimal numbers separated with hyphens.
</p>
<p>
   PATH4, CUSTOM-ID, CODEREF and FUZZY can contain any character
   besides square brackets.
</p>

<hr/>

<blockquote>

<p>I suggest to remove angle links.  If one needs spaces in PATH, she
can use standard link syntax instead.
</p>
<p>
I also suggest to remove <code>org-link-types</code> dependency in PROTOCOL
and match <code>[a-zA-Z]</code> instead, for portability.  &mdash; ngz
</p>
</blockquote>


</div>

</div>

<div id="outline-container-Macros" class="outline-3">
<h3 id="Macros"><a name="sec-6-7" id="sec-6-7"></a><span class="section-number-3">6.7</span> Macros</h3>
<div class="outline-text-3" id="text-Macros">


<p>
   Macros follow the pattern:
</p>



<pre class="example">{{{NAME(ARGUMENTS)}}}
</pre>


<p>
   NAME must start with a letter and can be followed by any number of
   alpha-numeric characters, hyphens and underscores.
</p>
<p>
   ARGUMENTS can contain anything but "}}}" string.  Values within
   ARGUMENTS are separated by commas.  Non-separating commas have to
   be escaped with a backslash character.
</p>
</div>

</div>

<div id="outline-container-Targets_and_Radio_Targets" class="outline-3">
<h3 id="Targets_and_Radio_Targets"><a name="sec-6-8" id="sec-6-8"></a><span class="section-number-3">6.8</span> Targets and Radio Targets</h3>
<div class="outline-text-3" id="text-Targets_and_Radio_Targets">


<p>
   Radio targets follow the pattern:
</p>



<pre class="example">&lt;&lt;&lt;CONTENTS&gt;&gt;&gt;
</pre>


<p>
   <a href="#CONTENTS">CONTENTS</a> can be any character besides <code>&lt;</code>, <code>&gt;</code> and "\n".  As far as
   objects go, it can contain <a href="#Entities_and_LaTeX_Fragments">entities</a>, <a href="#Entities_and_LaTeX_Fragments">latex fragments</a>, <a href="#Subscript_and_Superscript">subscript</a> and
   <a href="#Subscript_and_Superscript">superscript</a> only.
</p>
<p>
   Targets follow the pattern:
</p>



<pre class="example">&lt;&lt;TARGET&gt;&gt;
</pre>


<p>
   TARGET can contain any character besides <code>&lt;</code>, <code>&gt;</code> and "\n".  It
   cannot contain any object.
</p>
</div>

</div>

<div id="outline-container-Statistics_Cookies" class="outline-3">
<h3 id="Statistics_Cookies"><a name="sec-6-9" id="sec-6-9"></a><span class="section-number-3">6.9</span> Statistics Cookies</h3>
<div class="outline-text-3" id="text-Statistics_Cookies">


<p>
   Statistics cookies follow either pattern:
</p>



<pre class="example">[PERCENT%]
[NUM1/NUM2]
</pre>


<p>
   PERCENT, NUM1 and NUM2 are numbers or the empty string.
</p>
</div>

</div>

<div id="outline-container-Subscript_and_Superscript" class="outline-3">
<h3 id="Subscript_and_Superscript"><a name="sec-6-10" id="sec-6-10"></a><span class="section-number-3">6.10</span> Subscript and Superscript</h3>
<div class="outline-text-3" id="text-Subscript_and_Superscript">


<p>
   Pattern for subscript is:
</p>



<pre class="example">CHAR_SCRIPT
</pre>


<p>
   Pattern for superscript is:
</p>



<pre class="example">CHAR^SCRIPT
</pre>


<p>
   CHAR is any non-whitespace character.
</p>
<p>
   SCRIPT can be <code>*</code>, a string made of word-constituent characters
   maybe preceded by a plus or a minus sign, an expression enclosed in
   parenthesis (resp. curly brackets) containing balanced parenthesis
   (resp. curly brackets).
</p>
</div>

</div>

<div id="outline-container-Table_Cells" class="outline-3">
<h3 id="Table_Cells"><a name="sec-6-11" id="sec-6-11"></a><span class="section-number-3">6.11</span> Table Cells</h3>
<div class="outline-text-3" id="text-Table_Cells">


<p>
   Table cells follow the pattern:
</p>



<pre class="example">CONTENTS|
</pre>


<p>
   <a href="#CONTENTS">CONTENTS</a> can contain any character excepted a vertical bar.
</p>
</div>

</div>

<div id="outline-container-Timestamp" class="outline-3">
<h3 id="Timestamp"><a name="sec-6-12" id="sec-6-12"></a><span class="section-number-3">6.12</span> Timestamps</h3>
<div class="outline-text-3" id="text-Timestamp">


<p>
   There are seven possible patterns for timestamps:
</p>



<pre class="example">&lt;%%(SEXP)&gt;                                     (diary)
&lt;DATE TIME REPEATER&gt;                         (active)
[DATE TIME REPEATER]                         (inactive)
&lt;DATE TIME REPEATER&gt;--&lt;DATE TIME REPEATER&gt;   (active range)
&lt;DATE TIME-TIME REPEATER&gt;                    (active range)
[DATE TIME REPEATER]--[DATE TIME REPEATER]   (inactive range)
[DATE TIME-TIME REPEATER]                    (inactive range)
</pre>


<p>
   SEXP can contain any character excepted <code>&gt;</code> and <code>\n</code>.
</p>
<p>
   DATE follows the pattern:
</p>



<pre class="example">YYYY-MM-DD DAYNAME
</pre>


<p>
   Y, M and D are digits.  DAYNAME can contain any non
   whitespace-character besides <code>+</code>, <code>-</code>, <code>]</code>, <code>&gt;</code>, a digit or <code>\n</code>.
</p>
<p>
   TIME follows the pattern =H:MM~.  H can be one or two digit long
   and can start with 0.
</p>
<p>
   REPEATER follows the patter:
</p>



<pre class="example">MARK VALUE UNIT
</pre>


<p>
   MARK is <code>+</code> (cumulate type), <code>++</code> (catch-up type) or <code>.+</code> (restart
   type).
</p>
<p>
   VALUE is a number.
</p>
<p>
   UNIT is a character among <code>h</code> (hour), <code>d</code> (day), <code>w</code> (week), <code>m</code>
   (month), <code>y</code> (year).
</p>
<p>
   MARK, VALUE and UNIT are not separated by whitespace characters.
</p>
</div>

</div>
